In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
train_df=pd.read_csv('train.csv')
test_df=pd.read_csv('test.csv')
train_df.head(5)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [3]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
User_ID                       550068 non-null int64
Product_ID                    550068 non-null object
Gender                        550068 non-null object
Age                           550068 non-null object
Occupation                    550068 non-null int64
City_Category                 550068 non-null object
Stay_In_Current_City_Years    550068 non-null object
Marital_Status                550068 non-null int64
Product_Category_1            550068 non-null int64
Product_Category_2            376430 non-null float64
Product_Category_3            166821 non-null float64
Purchase                      550068 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [4]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
User_ID                       233599 non-null int64
Product_ID                    233599 non-null object
Gender                        233599 non-null object
Age                           233599 non-null object
Occupation                    233599 non-null int64
City_Category                 233599 non-null object
Stay_In_Current_City_Years    233599 non-null object
Marital_Status                233599 non-null int64
Product_Category_1            233599 non-null int64
Product_Category_2            161255 non-null float64
Product_Category_3            71037 non-null float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

In [5]:
train_df.Product_Category_2.value_counts()

8.0     64088
14.0    55108
2.0     49217
16.0    43255
15.0    37855
5.0     26235
4.0     25677
6.0     16466
11.0    14134
17.0    13320
13.0    10531
9.0      5693
12.0     5528
10.0     3043
3.0      2884
18.0     2770
7.0       626
Name: Product_Category_2, dtype: int64

In [6]:
train_df.Product_Category_2.fillna(train_df.Product_Category_2.value_counts().idxmax(),inplace=True)

In [7]:
test_df.Product_Category_2.fillna(test_df.Product_Category_2.value_counts().idxmax(),inplace=True)

In [8]:
train_df.apply(lambda x: len(x.unique()))

User_ID                        5891
Product_ID                     3631
Gender                            2
Age                               7
Occupation                       21
City_Category                     3
Stay_In_Current_City_Years        5
Marital_Status                    2
Product_Category_1               20
Product_Category_2               17
Product_Category_3               16
Purchase                      18105
dtype: int64

In [9]:
X=train_df.drop(["Product_ID","User_ID","Product_Category_3","Purchase"],axis=1)

In [10]:
Y=pd.DataFrame(train_df.iloc[:,-1])
Y.head()

   Purchase
0      8370
1     15200
2      1422
3      1057
4      7969

In [11]:
X.head(10)

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
0,F,0-17,10,A,2,0,3,8.0
1,F,0-17,10,A,2,0,1,6.0
2,F,0-17,10,A,2,0,12,8.0
3,F,0-17,10,A,2,0,12,14.0
4,M,55+,16,C,4+,0,8,8.0
5,M,26-35,15,A,3,0,1,2.0
6,M,46-50,7,B,2,1,1,8.0
7,M,46-50,7,B,2,1,1,15.0
8,M,46-50,7,B,2,1,1,16.0
9,M,26-35,20,A,1,1,8,8.0

In [12]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
var_mod=["Gender",'City_Category']
for i in var_mod:
    X[i]=le.fit_transform(X[i])
X.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
0,0,0-17,10,0,2,0,3,8.0
1,0,0-17,10,0,2,0,1,6.0
2,0,0-17,10,0,2,0,12,8.0
3,0,0-17,10,0,2,0,12,14.0
4,1,55+,16,2,4+,0,8,8.0

In [13]:
#onehotencoding
X=pd.get_dummies(X,columns=["Age","City_Category"])

In [14]:
X.head()

,Gender,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Age_0-17,Age_18-25,Age_26-35,Age_36-45,Age_46-50,Age_51-55,Age_55+,City_Category_0,City_Category_1,City_Category_2
0,0,10,2,0,3,8.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,0,10,2,0,1,6.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
2,0,10,2,0,12,8.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
3,0,10,2,0,12,14.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,1,16,4+,0,8,8.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0

In [15]:
X.Stay_In_Current_City_Years.value_counts()

1     193821
2     101838
3      95285
4+     84726
0      74398
Name: Stay_In_Current_City_Years, dtype: int64

In [16]:
def map_stay(x):
    if x=='4+':
        return 4
    else:
        return int(x)
X['Stay_In_Current_City_Years']=X['Stay_In_Current_City_Years'].apply(map_stay)

In [17]:
X.Stay_In_Current_City_Years.value_counts()

1    193821
2    101838
3     95285
4     84726
0     74398
Name: Stay_In_Current_City_Years, dtype: int64

In [18]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 16 columns):
Gender                        550068 non-null int64
Occupation                    550068 non-null int64
Stay_In_Current_City_Years    550068 non-null int64
Marital_Status                550068 non-null int64
Product_Category_1            550068 non-null int64
Product_Category_2            550068 non-null float64
Age_0-17                      550068 non-null float64
Age_18-25                     550068 non-null float64
Age_26-35                     550068 non-null float64
Age_36-45                     550068 non-null float64
Age_46-50                     550068 non-null float64
Age_51-55                     550068 non-null float64
Age_55+                       550068 non-null float64
City_Category_0               550068 non-null float64
City_Category_1               550068 non-null float64
City_Category_2               550068 non-null float64
dtypes: float64(11), int64(5)
memory usage: 67.1 MB

In [19]:
X=X.astype(float)
X.head()

,Gender,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Age_0-17,Age_18-25,Age_26-35,Age_36-45,Age_46-50,Age_51-55,Age_55+,City_Category_0,City_Category_1,City_Category_2
0,0.0,10.0,2.0,0.0,3.0,8.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,0.0,10.0,2.0,0.0,1.0,6.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
2,0.0,10.0,2.0,0.0,12.0,8.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
3,0.0,10.0,2.0,0.0,12.0,14.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,1.0,16.0,4.0,0.0,8.0,8.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0

In [20]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 16 columns):
Gender                        550068 non-null float64
Occupation                    550068 non-null float64
Stay_In_Current_City_Years    550068 non-null float64
Marital_Status                550068 non-null float64
Product_Category_1            550068 non-null float64
Product_Category_2            550068 non-null float64
Age_0-17                      550068 non-null float64
Age_18-25                     550068 non-null float64
Age_26-35                     550068 non-null float64
Age_36-45                     550068 non-null float64
Age_46-50                     550068 non-null float64
Age_51-55                     550068 non-null float64
Age_55+                       550068 non-null float64
City_Category_0               550068 non-null float64
City_Category_1               550068 non-null float64
City_Category_2               550068 non-null float64
dtypes: float64(16)
memory usage: 67.1 MB

In [21]:
Y.head()

   Purchase
0      8370
1     15200
2      1422
3      1057
4      7969

In [22]:
from sklearn.linear_model import LinearRegression
linreg=LinearRegression()
linreg=linreg.fit(X,Y)

In [23]:
test_df.head(5)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [24]:
test_X=test_df.drop(["Product_ID","User_ID","Product_Category_3",],axis=1)

In [25]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
var_mod=["Gender",'City_Category']
for i in var_mod:
    test_X[i]=le.fit_transform(test_X[i])
test_X.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
0,1,46-50,7,1,2,1,1,11.0
1,1,26-35,17,2,0,0,3,5.0
2,0,36-45,1,1,4+,1,5,14.0
3,0,36-45,1,1,4+,1,4,9.0
4,0,26-35,1,2,1,0,4,5.0

In [26]:

test_X=pd.get_dummies(test_X,columns=["Age","City_Category"])

In [27]:
test_X['Stay_In_Current_City_Years']=test_X['Stay_In_Current_City_Years'].apply(map_stay)
test_X=test_X.astype(float)
test_X.head()

,Gender,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Age_0-17,Age_18-25,Age_26-35,Age_36-45,Age_46-50,Age_51-55,Age_55+,City_Category_0,City_Category_1,City_Category_2
0,1.0,7.0,2.0,1.0,1.0,11.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
1,1.0,17.0,0.0,0.0,3.0,5.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
2,0.0,1.0,4.0,1.0,5.0,14.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0
3,0.0,1.0,4.0,1.0,4.0,9.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0
4,0.0,1.0,1.0,0.0,4.0,5.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0

In [28]:
ypred=linreg.predict(test_X)
ypred

array([[ 11089.875],
       [ 11063.875],
       [  8754.25 ],
       ...,
       [ 10814.875],
       [  7152.875],
       [  9546.25 ]])

In [31]:
result=pd.DataFrame()
result["User_ID"]=test_df["User_ID"]
result["Product_ID"]=test_df["Product_ID"]
result["Purchase"]=ypred
result.to_csv("new_submission.csv")

In [30]:
from sklearn.preprocessing import PolynomialFeatures
poly_reg=PolynomialFeatures(degree=2)
X_poly=poly_reg.fit_transform(X)

In [32]:
test_X_poly=poly_reg.fit_transform(test_X)

In [ ]:
from sklearn.linear_model import LinearRegression
linreg_2=LinearRegression()
linreg_2.fit(X_poly,Y)

In [37]:
ypred_poly=linreg_2.predict(test_X_poly)
ypred_poly

array([[ 12244.52929688],
       [ 10641.31054688],
       [  8175.93554688],
       ...,
       [ 11956.00195312],
       [  6995.56054688],
       [  9520.06054688]])

In [38]:
presult=pd.DataFrame()
presult["User_ID"]=test_df["User_ID"]
presult["Product_ID"]=test_df["Product_ID"]
presult["Purchase"]=ypred_poly
presult.to_csv("polyreg_submission.csv")